---
kind: property
id: P:Autodesk.Revit.DB.LayerModifier.IsValidObject
source: html/12a58b45-2e8c-1d5a-701f-bbfc94006d19.htm
---
# Autodesk.Revit.DB.LayerModifier.IsValidObject Property

Specifies whether the .NET object represents a valid Revit entity.

## Syntax (C#)
```csharp
public bool IsValidObject { get; }
```

## Returns
True if the API object holds a valid Revit native object, false otherwise.

## Remarks
If the corresponding Revit native object is destroyed, or creation of the corresponding object is undone,
 a managed API object containing it is no longer valid. API methods cannot be called on invalidated wrapper objects.